{
  "mod": {
    "name": "Bundle Of Food",
    "version": "2.0.7",
    "authors": ["SandTag"],
    "credits": "Mistress Alison - Very helpful :) \nPandemonium - Very helpful :)",
    "description": "A collection of 38 food related relics. \n Contains a variety of food types, all giving Max HP and a benefit.",
    "mts_version": "3.29.0",
    "sts_version": "03-07-2022",
    "dependencies": ["basemod","stslib","bundlecore"],
    "optional_dependencies": []
  },
  "cards": [
  ],
  "relics": [
    {
      "name": "Cheese Scone",
      "tier": "Common",
      "pool": "",
      "description": "Upon pickup gain 2 Max HP.\nAt the start of combat gain 2 Temporary Strength and 1 Temporary Dexterity.",
      "flavorText": "Is it a cake, biscuit or sponge?"
    },
    {
      "name": "Coconut",
      "tier": "Common",
      "pool": "",
      "description": "Gain 4 Max HP on pickup.\nGain 1 potion slot on pickup.",
      "flavorText": "A delightful fruit from a place far warmer than the Spire. Its shell can carry a potion after consuming the fruit."
    },
    {
      "name": "Darkling Jelly",
      "tier": "Common",
      "pool": "",
      "description": "Gain 4 Max HP on pickup.\nEach time you deal Fatal damage during combats with 2 or more enemies, heal 1 HP.",
      "flavorText": "Sticky Jelly made from the goo of Darklings. You seem to understand how to extract vitality from groups of creatures after eating it."
    },
    {
      "name": "Foxnut",
      "tier": "Common",
      "pool": "",
      "description": "Gain 4 Max HP on pickup.\nAt the start of combat draw 1 card.",
      "flavorText": "Sourced not from trees but the miracle springs, these nuts are sweet and provide miraculous bursts of swiftness."
    },
    {
      "name": "Lemon Float",
      "tier": "Common",
      "pool": "",
      "description": "Gain 2 Max HP on pickup.\nAt the start of your second turn, draw 2 cards.",
      "flavorText": "A frosty citrussy float. once you get past the initial coldness it, provides a zingy swiftness."
    },
    {
      "name": "Snake™ Bubbles",
      "tier": "Common",
      "pool": "",
      "description": "Heal 12 HP and gain 2 Max HP on pickup.\nAt the start of turn 3 draw 2 cards.",
      "flavorText": "Now with an added pop! Snake™ managed to replicate the flavour of the Snakefruit and add them to this tea! It has sold much better than the now very expensive boxed variety."
    },
    {
      "name": "Apple Pie",
      "tier": "Uncommon",
      "pool": "",
      "description": "Gain 5 Max HP on pickup.\nWhenever you play a Power, gain 1 Temporary HP.",
      "flavorText": "Apples from a faraway land were baked into a divine pastry and provide a long lasting source of vitality."
    },
    {
      "name": "Cured Jaw Worm",
      "tier": "Uncommon",
      "pool": "",
      "description": "Gain 3 Max HP on pickup.\nAt the start of every odd turn, gain 1 Strength.\nCan be cooked at Rest Sites.",
      "flavorText": "The cured tongue of a slain Jaw Worm, its toughness still remains."
    },
    {
      "name": "Joja Cola",
      "tier": "Uncommon",
      "pool": "",
      "description": "Gain 2 Max HP and heal 2 HP on pickup.\nAt the start of your third turn, gain [E].",
      "flavorText": "Hailing from a farming community, this drink seems questionable at best in most ways."
    },
    {
      "name": "Lemon Snucks",
      "tier": "Uncommon",
      "pool": "",
      "description": "Upon pickup gain 7 Max HP.\nThe next relic in a chest you see will be lost, but you will gain 17 more Max HP.",
      "flavorText": "A citygoers favourite thing to pair with Snake™ as the lemon flavour helps compliment the subtle nuttyness of the Snake™."
    },
    {
      "name": "Pomegranate Daiquiri",
      "tier": "Uncommon",
      "pool": "",
      "description": "Lose 7 Max HP on pickup.\nAt the end of your turn, for every 2 Skills in your hand, draw 1 card next turn.",
      "flavorText": "An unusual drink that can help refine technique retention. Its alcohol content, however makes it somewhat toxic to the Spire's denizens."
    },
    {
      "name": "Shellard Spaghetti",
      "tier": "Uncommon",
      "pool": "",
      "description": "Gain 2 Max HP on pickup.\nAt the start of combat gain 1 Metallicize per Power in your deck, but lose 1 Metallicize per Power played.",
      "flavorText": "With a whole Lavagullin claw! It seems to make your techniques provide a steely posture that fades in the heat of battle."
    },
    {
      "name": "Awoken Cake",
      "tier": "Rare",
      "pool": "",
      "description": "LOSE up to 6 HP on pickup.\nThe first time each turn you Exhaust a card, gain 1 Strength.\nMazaleth will be angry.",
      "flavorText": "Despite its appearance, this cake is actually very small because the Cultists say their leader can't eat too much sugar at once. The guilt of eating someone else's cake is painful."
    },
    {
      "name": "Baked Sweet Potato",
      "tier": "Rare",
      "pool": "",
      "description": "Upon pickup gain 5 Max HP.\nOnce per turn you may left click this relic's Button to discard a card in hand then draw a card randomly from your discard pile.",
      "flavorText": "A somewhat sweet, cooked vegetable that helps you remember things later."
    },
    {
      "name": "Chilli Dog",
      "tier": "Rare",
      "pool": "",
      "description": "Upon pickup gain 4 Max HP, if you play 10 cards in one turn apply 1 Slow to ALL enemies.",
      "flavorText": "Rumour has it that this relic's Recipe arrived from a mysterious swirling portal in the red-mask district, but most citygoers are too afraid of the red gang to check it out."
    },
    {
      "name": "Collectors Mints",
      "tier": "Rare",
      "pool": "Blue",
      "description": "Gain 4 Max HP on pickup.\nAt the end of your turn, if you have at least 3 unique Orbs, gain 1 Focus.",
      "flavorText": "A unique brand of mints produced by the Collector, each mint has a different flavour. Perhaps your [ORB] should be, too?"
    },
    {
      "name": "Hexacakes",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 6 Max HP on pickup.\nWhen you play a power, gain 1 Mantra. The first time you play 6 Powers each combat, gain 4 Mantra.",
      "flavorText": "Spicy and warm, these cakes bring bursts of divine and ethereal energy. Favoured by a certain ghost."
    },
    {
      "name": "Hot Chocolate",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 2 Max HP and heal 50% of your Max HP on pickup.\nUpgrade the first 3 unupgraded cards drawn each combat.",
      "flavorText": "A sweet drink from the Brass Tundra, it is seemingly a peaceful beverage."
    },
    {
      "name": "Nob Jerky",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 4 Max HP on pickup.\nWhenever you play 15 Skills during combat, gain 1 Enrage.",
      "flavorText": "Smoked meat from a Gremlin Nob. Eating it fills you with an indescribable anger."
    },
    {
      "name": "Ominous Oatcakes",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 14 Max HP on pickup.\nWhen you play a Fleeting card, obtain an Un-upgraded copy of the card and lose 1 Max HP that increases by 1 with each use.",
      "flavorText": "These strange biscuits seem to be departing from our world, eat them quickly!.. or don't?"
    },
    {
      "name": "Passionfruit",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 8 Max HP on pickup.\nAt the end of your turn draw 2 cards next turn per Power in your hand.",
      "flavorText": "A powerful fruit from the jungles, its sour tang can bring swiftness to unrealised techniques."
    },
    {
      "name": "Pineapple Sorbet",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 1 Max HP on pickup.\nAt the end of your turn draw 1 more next turn card per card in your hand over 5.",
      "flavorText": "The refreshing pineapple sorbet hails from a land extremely far from the spire. Consuming it can help retain one's skill over time."
    },
    {
      "name": "Slaver Sliders",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 4 Max HP on pickup.\nAt the start of combat, apply 1 Weak to ALL enemies.",
      "flavorText": "Now with Snecko's special sauce."
    },
    {
      "name": "Snake™",
      "tier": "Rare",
      "pool": "Green",
      "description": "Heal to full on pickup.\nThe first time you play a Power each combat gain 4 Accuracy and 4 Mallable.",
      "flavorText": "It used to be popular in the city, but when Snake Plants were bewitched by the Collector, the stonks of this tea brand collapsed."
    },
    {
      "name": "Cooked Jaw Worm",
      "tier": "Special",
      "pool": "",
      "description": "Gain 5 Max HP on cooking.\nAt the start of your turn, gain 1 Strength.",
      "flavorText": "Now cooked with the few herbs found in the spire, this flavourful meal carries strong vitality and power."
    },
    {
      "name": "Banana Energy",
      "tier": "Boss",
      "pool": "Blue",
      "description": "Gain 00000111 Max HP on pickup.\nWhen you evoke 1 orb, gain [E] and increase the threshold by 1 this turn.",
      "flavorText": "Now with real energy! Might actually be circuit lubricant."
    },
    {
      "name": "Blighted Watermelon",
      "tier": "Boss",
      "pool": "",
      "description": "bundlecore:Rare\nLose 25% Max HP on pickup.\nAt the start of combat, gain bundle_of_food:Watermelon_Buffs .",
      "flavorText": "While it is still edible the Watermelon preserves much of the ichor and toxin of its taint."
    },
    {
      "name": "Brick of Exxod",
      "tier": "Boss",
      "pool": "",
      "description": "Lose 25% of your Max HP on pickup.\nAt the start of your turn, draw 2 cards.\nIf you play 60 cards in one turn, Obtain Truest Power.",
      "flavorText": "As soon as you look at it you get an overwhelming feeling... INFINITE POWER?!?!? I MUST EAT IT. ALL OF IT?!?!"
    },
    {
      "name": "Cultist's Chair Cookie",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 7 Max HP on pickup.\nAt the start of combat, gain 1 Ritual, 1 Strength and 1 Curiosity.",
      "flavorText": "Strange cookies that ominously pulsate, they give you an uncanny urge to dab."
    },
    {
      "name": "Cursed Walnut",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 3 Max HP on pickup.\nAt the start of your turn, gain [E] [E] but lose 2 Dexterity.",
      "flavorText": "A walnut that only grows ontop of mass graves, its screaming shell will petrify the wielder unless they learn to handle its immense power."
    },
    {
      "name": "Delicious Donu",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 11 Max HP on pickup.\nAt the start of your turn gain [E], Donu will arrive in every elite room and get stronger the higher you climb.\nDonu will be your destiny.",
      "flavorText": "A forsaken treat that appears to be an effigy of a powerful creature found within the spire, such creature draws hatred towards it so consume at your own peril."
    },
    {
      "name": "Dragonfruit",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 8 Max HP on pickup.\nAt the start of your turn, lose [E] but draw 3 additional cards.\nGain 2 Vigor when playing a card.\nAfter playing 7 cards gain 1 more Vigor per card each turn.",
      "flavorText": "A fruit bearing overwhelming power, it hastens and invigorates the wielder so much it consumes much of their natural stamina."
    },
    {
      "name": "Eggplant",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 11 Max HP on pickup.\nWhenever you play a power gain 1 Dexterity and 1 Metallicize.",
      "flavorText": "Remarkably well preserved from the spireblight, the Eggplant is big and hard with a salty and bitter flavour."
    },
    {
      "name": "Frosted Eclair",
      "tier": "Boss",
      "pool": "",
      "description": "Upon pickup gain 8 Max HP.\nAt the start of turn 3 gain 5 Strength.",
      "flavorText": "A strange oblong pastry with a sweet chocolate frosting... filled with sweet, sticky, creamy white goodness! I want another one! - Ranwid"
    },
    {
      "name": "Fruit Salad",
      "tier": "Boss",
      "pool": "",
      "description": "bundlecore:Rare\nWhen you climb a floor gain 1 Max HP.\nGain bundle_of_food:Fruity_Buffs related to each fruit in the bowl.",
      "flavorText": "A confused and chaotic cacophony of fruits put together into a bowl with cursed, oddly green cream."
    },
    {
      "name": "Pickle Pizza",
      "tier": "Boss",
      "pool": "",
      "description": "Gain 5 Max HP on pickup. Negate the negative effects of Weak and Frail.\nWeak increases attack damage by 12.5%, Frail increases Block gain by 12.5%, Vulnerable now provides 40% block versus incoming damage.",
      "flavorText": "Why? Well, because pickles seem to cure most ailments found in the Spire. Most of the Spire's denizens hate its taste, though."
    },
    {
      "name": "Snecko Stew",
      "tier": "Boss",
      "pool": "",
      "description": "Gain ? Max HP on pickup.\nWhen you play a card, draw and discard 3 cards randomly. If you drew cards this way, randomize the cost of all cards in your hand and decrease the effect by 1 card this turn.",
      "flavorText": "Featuring two Snecko feet, this dubious looking stew confers bizarre and unexpected energy and swiftness. Lick with caution."
    }
  ],
  "potions": [
  ],
  "creatures": [
  ],
  "keywords": [
    {
      "name": "Fruity Buffs",
      "description": "Draw 1 more card at the start of your turn.\nGain 1 Metallicize when playing a Power and 1 Vigor when playing any card.\nGain 1 Strength per 20 floors.\nGain 1 XEnergy per 26 floors.\nDraw 1 more card next turn per Power remaining in your hand."
    },
    {
      "name": "Watermelon Buffs",
      "description": "Gain 2 Block per 6 floors.\nGain 1 Strength per 10 floors.\nGain 2 Plated Armor per 15 floors.\nGain 1 XEnergy per 20 floors.\nGain 3 Thorns per 25 floors.\nGain 1 Draw per 30 floors."
    },
    {
      "name": "X-Energy",
      "description": "X-cost cards are played as if you have more [E]."
    }
  ]
}