{
  "mod": {
    "name": "EXCEPTION",
    "version": "1.0.2",
    "authors": ["Alchyr"],
    "credits": "",
    "description": "This mod contains a card that has a relatively normal effect, except when under certain conditions. I would recommend reading the card text thoroughly, and memorizing it, except if you don't like reading, or if you're out of combat, in which case you cannot read the card text, except if you really like words, in which case you could probably search for an image of the card text, except if this card hasn't been screenshotted and uploaded anywhere, in which case you probably won't be able to find it.",
    "mts_version": "3.6.3",
    "sts_version": "01-23-2019",
    "dependencies": ["basemod","stslib"]
  },
  "cards": [
    {
      "name": "Exception",
      "color": "Colorless",
      "rarity": "Rare",
      "type": "Attack",
      "cost": "1",
      "description": "Add this card to your hand at the start of combat, Except if you're facing an Elite, Except if you have not entered combat since the last Campire, Except if you have visited a Shop after that Campfire, Except if this is your only Colorless card, Except you have a Curse, Except if you have a Relic that takes advantage of Curses.\nRetains, Except when you end your turn with exactly 3 cards in your hand, Except if those 3 cards are of the same type, Except if they're of all the same cost.\nDeal 9 damage, Except if the target has full health, in which case gain 9 Block, Except if the target does not have any debuffs, in which case Apply 3 Weak and Vulnerable to the target, Except if you have full health, in which case gain 2 Strength, Except if there are multiple enemies, in which case deal 9 damage to ALL enemies, Except if the target has any buffs, in which case apply 9 Poison, Except if you have any debuffs, in which case gain 1 Artifact.\nExcept if this is Act 3 or beyond, in which case apply 2 random of the previous effects and play a copy of this card, Except if this card has been triggered 2 or more times by the previous effect, in which case play a random card in your hand and Exhaust it, Except if your hand is empty, in which case add 3 copies of this card to your hand.\nExcept if any enemy has Flight, in which case deal 9 damage to that enemy 3 times.\nExcept if this is the only card in your hand and your draw pile is empty, in which case add 3 times the current Act random cards to your hand."
    }
  ],
  "relics": [
  ],
  "potions": [
  ],
  "creatures": [
  ],
  "keywords": [
  ]
}
