{
  "mod": {
    "name": "Rogue Adventure",
    "version": "1.0.0",
    "authors": ["Lord Cat II"],
    "credits": "",
    "description": "A mod that adds in content from \"Rogue Adventure\", a free mobile Roguelike. Would highly recommend checking it out on the appstore! \n\nThis is not made by the same creators, it's a fan project. \n\nFor now the mod is just relics, but expect more content to come soon!",
    "mts_version": "3.29.0",
    "sts_version": "03-07-2022",
    "dependencies": ["basemod","stslib"],
    "optional_dependencies": []
  },
  "cards": [
  ],
  "relics": [
    {
      "name": "Anti-Monster Mine",
      "tier": "Common",
      "pool": "",
      "description": "Deals 9 damage back and applies 1 Weak to the first enemy that attacks you each combat.",
      "flavorText": "A small explosive mine meant to deter monsters without harming the holder."
    },
    {
      "name": "Darkness Boots",
      "tier": "Common",
      "pool": "",
      "description": "At the start of the turn, gain 2 Block for every enemy with Weak or Vulnerable.",
      "flavorText": "A powerful relic that draws on the suffering of others. Luckily the magic is confined to a stylish pair of boots."
    },
    {
      "name": "Living Mana",
      "tier": "Common",
      "pool": "",
      "description": "At the end of your turn, deal 7 damage to ALL enemies if you have any unused mana.",
      "flavorText": "Let nothing go to waste."
    },
    {
      "name": "Bounty Hunter",
      "tier": "Uncommon",
      "pool": "",
      "description": "Whenever an enemy dies, gain 8 Gold.",
      "flavorText": "With so many monsters living in the Spire, it's easy to find someone who wants them dead."
    },
    {
      "name": "Dark Wall",
      "tier": "Uncommon",
      "pool": "",
      "description": "At the start of each combat, apply 1 Weak to ALL enemies.",
      "flavorText": "A dark mist follows you around, obscuring the view of your enemies."
    },
    {
      "name": "Electrostatic Field",
      "tier": "Uncommon",
      "pool": "",
      "description": "Everytime you fully Block an attack, gain 1 charge. At the end of your turn, deal damage to ALL enemies equal to the charges. Resets each combat.",
      "flavorText": "A charge that absorb all static generated around it."
    },
    {
      "name": "Explosive Enemies",
      "tier": "Uncommon",
      "pool": "",
      "description": "Whenever an enemy dies, deal 10 damage to ALL enemies.",
      "flavorText": "You don't know how this works, and you don't really have an interest in learning."
    },
    {
      "name": "Solid Shell",
      "tier": "Uncommon",
      "pool": "",
      "description": "Gain 8 Block every 10 cards you play.",
      "flavorText": "Even just a bit of plating offers more defense than none."
    },
    {
      "name": "Golden Shield",
      "tier": "Rare",
      "pool": "",
      "description": "Gain 3 Strength next turn if you fully Block ALL attacks from enemies this turn.",
      "flavorText": "A spotless golden shield that has seen many battles. One of the last to avoid corruption."
    },
    {
      "name": "Snail Shell",
      "tier": "Rare",
      "pool": "",
      "description": "At the start of each combat, gain 2 Blur.",
      "flavorText": "A near indestructible shell that has lasted from before the Spireblight."
    },
    {
      "name": "Soul Drain",
      "tier": "Rare",
      "pool": "",
      "description": "Heal 3 HP when you kill a non-minion enemy.",
      "flavorText": "With every slain enemy you only feel more invigorated."
    },
    {
      "name": "Growth Blessing",
      "tier": "Special",
      "pool": "",
      "description": "At the end of combat, raise your Max HP by 1.",
      "flavorText": "After every challenge you feel more capable."
    },
    {
      "name": "Rock Dagger",
      "tier": "Special",
      "pool": "",
      "description": "Every other turn, after playing your first Attack card, gain 5 Block.",
      "flavorText": "A dagger infused with the might of the earth."
    },
    {
      "name": "Thunder Dagger",
      "tier": "Special",
      "pool": "",
      "description": "Every other turn, your first Attack card deals 8 damage to a random enemy.",
      "flavorText": "A dagger infused with the might of lightning."
    },
    {
      "name": "Weak Dagger",
      "tier": "Special",
      "pool": "",
      "description": "Every other turn, your first Attack card applies 1 Weak to a random enemy.",
      "flavorText": "A dagger infused with the might of darkness."
    },
    {
      "name": "Book of Evil",
      "tier": "Boss",
      "pool": "",
      "description": "Gain [E] at the start of your turn. Upon pickup, reduce your Max HP by 40%.",
      "flavorText": "The book drains your very life away, but offers tremendous power in return."
    },
    {
      "name": "Mystery Box",
      "tier": "Shop",
      "pool": "",
      "description": "Upon pickup, obtain 1 Common Relic and 1 Uncommon Relic.",
      "flavorText": "A large soundproof box, so there's no shaking to see what you may get."
    }
  ],
  "potions": [
  ],
  "creatures": [
  ],
  "keywords": [
    {
      "name": "Multiword Keyword",
      "description": "Make sure the first element in the NAMES is the same as your PROPER_NAME. The rest should use _ to replace spaces. In card text, you'll use the underscore versions."
    },
    {
      "name": "This is displayed in the tooltip.",
      "description": "This is displayed in the tooltip. Note, spaces are not allowed in NAMES. For multi-word keywords, see the next one."
    }
  ]
}